Комплексная_автоматизация_2_МОМ_2019/src/Enums/КатегорииУдержаний/КатегорииУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииУдержаний</name>
  <enumValues>
    <name>ПрофсоюзныеВзносы</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛист</name>
  </enumValues>
  <enumValues>
    <name>ВознаграждениеПлатежногоАгента</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеЗаНеотработанныеДниОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ДСВ</name>
  </enumValues>
  <enumValues>
    <name>ДобровольныеВзносыВНПФ</name>
  </enumValues>
  <enumValues>
    <name>ПрочееУдержаниеВПользуТретьихЛиц</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеВСчетРасчетовПоПрочимОперациям</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеСодержаниеУдержаниеЗаНеотработанныеДниОтпуска</name>
  </enumValues>
  <enumValues>
    <name>ОбязательстваПоУченическомуДоговору</name>
  </enumValues>
  <enumValues>
    <name>ДенежноеДовольствиеУдержаниеЗаНеотработанныеДниОтпуска</name>
  </enumValues>
</mdclass:Enum>

Комплексная_автоматизация_2_МОМ_2019/src/Enums/КатегорииУдержаний/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	РасчетЗарплатыРасширенныйВызовСервера.КатегорииУдержанийОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);		
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ДействующиеКатегории() Экспорт
	
	МассивКатегорий = Новый Массив;
	
	ИспользоватьРасчетСохраняемогоДенежногоСодержания = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетСохраняемогоДенежногоСодержания");
	ИспользоватьРасчетСохраняемогоДенежногоДовольствия = Метаданные.ФункциональныеОпции.Найти("ИспользоватьРасчетДенежногоДовольствияВоеннослужащих") <> Неопределено 
															ИЛИ Метаданные.ФункциональныеОпции.Найти("ИспользоватьРасчетДенежногоДовольствияСотрудниковОргановИсполнительнойВласти") <> Неопределено
															ИЛИ Метаданные.ФункциональныеОпции.Найти("ИспользоватьРасчетДенежногоДовольствияВоеннослужащихПоПризыву") <> Неопределено;
	
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ПрофсоюзныеВзносы);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ИсполнительныйЛист);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ВознаграждениеПлатежногоАгента);
	Если ИспользоватьРасчетСохраняемогоДенежногоСодержания Тогда
		МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ДенежноеСодержаниеУдержаниеЗаНеотработанныеДниОтпуска);
	КонецЕсли;
	Если ИспользоватьРасчетСохраняемогоДенежногоДовольствия Тогда
		МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ДенежноеДовольствиеУдержаниеЗаНеотработанныеДниОтпуска);
	КонецЕсли;
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.УдержаниеЗаНеотработанныеДниОтпуска);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ДСВ);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ДобровольныеВзносыВНПФ);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.ПрочееУдержаниеВПользуТретьихЛиц);
	МассивКатегорий.Добавить(Перечисления.КатегорииУдержаний.УдержаниеВСчетРасчетовПоПрочимОперациям);
	
	Возврат МассивКатегорий;
	
КонецФункции

#КонецОбласти

#КонецЕсли
